<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;

class DisciplineFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array
     */
    public function definition()
    {
        $names=[
            'Маркетинг у соціальних мережах',
            'Надійність комп`ютерних систем і мереж',
            'Теоретичні основи проєктування комп’ютерних мереж',
            'Організація економподорожей',
            'Backend-розробка на базі Python',

            'Організаційна психологія',
            'Сучасні тенденції розвитку конструкції автомобілів',
            'Розробка програмного забезпечення на платформі node.js ',
            'Комп`ютерне моделювання',
            'Психологія',

            'Основи охорони праці ',
            'Безпека життєдіяльності та цивільний захист',
            'Архітектурне проєктування за дипломною тематикою',
            'Інтеграція постпромислових територій у простір міста',
            'Інженерне обладнання будівель',

            'Спеціалізований переклад 2.Переклад юридичної літератури.',
            'Практичний курс усного та писемного мовлення ОІМ',
            'Комп’ютерний переклад',
            'Практикум з письмового перекладу',
            'Інтелектуальні інформаційні сервіси',

            'Семантичні Веб рішення',
            'Стандартизація, верифікація та уніфікація інженерії вимог та якості',
            'Інформаційні системи на основі знань',
            'Засоби реалізації бізнес-моделей предметних областей та імплементації',
            'Концептуальні основи data science',
        ];
        return [
            'name' => $this->faker->unique()->randomElement($names),
            'description' => $this->faker->text(),
        ];
    }
}
